[NoCoverage] BlockStatement
src/incomeTax.ts:6:43
 export {}  // make this a self-contained module
 
 // using conditionals
-function grossTax(income: number): number {
-    if ((income >= 0) && (income <= 10000)) { return 0 }
-    if ((income > 10000) && (income <= 20000)) 
-    { return 0.10 * (income - 10000) }
-    if ((income > 20000) && (income <= 50000)) 
-    { return grossTax(20000) + 0.20 * (income - 20000) }
-     return grossTax(50000) + 0.25 * (income - 50000) 
-}
+function grossTax(income: number): number {}
 
 // represents a tax bracket for income lower < income <= upper.

[NoCoverage] ConditionalExpression
src/incomeTax.ts:7:9
 
 // using conditionals
 function grossTax(income: number): number {
-    if ((income >= 0) && (income <= 10000)) { return 0 }
+    if (true) { return 0 }
     if ((income > 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }

[NoCoverage] EqualityOperator
src/incomeTax.ts:7:10
 
 // using conditionals
 function grossTax(income: number): number {
-    if ((income >= 0) && (income <= 10000)) { return 0 }
+    if ((income < 0) && (income <= 10000)) { return 0 }
     if ((income > 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }

[NoCoverage] EqualityOperator
src/incomeTax.ts:8:30
 // using conditionals
 function grossTax(income: number): number {
     if ((income >= 0) && (income <= 10000)) { return 0 }
-    if ((income > 10000) && (income <= 20000)) 
+    if ((income > 10000) && (income < 20000)) 
     { return 0.10 * (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 

[NoCoverage] EqualityOperator
src/incomeTax.ts:8:10
 // using conditionals
 function grossTax(income: number): number {
     if ((income >= 0) && (income <= 10000)) { return 0 }
-    if ((income > 10000) && (income <= 20000)) 
+    if ((income <= 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 

[NoCoverage] BlockStatement
src/incomeTax.ts:9:5
 function grossTax(income: number): number {
     if ((income >= 0) && (income <= 10000)) { return 0 }
     if ((income > 10000) && (income <= 20000)) 
-    { return 0.10 * (income - 10000) }
+    {}
     if ((income > 20000) && (income <= 50000)) 
     { return grossTax(20000) + 0.20 * (income - 20000) }

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:9:14
 function grossTax(income: number): number {
     if ((income >= 0) && (income <= 10000)) { return 0 }
     if ((income > 10000) && (income <= 20000)) 
-    { return 0.10 * (income - 10000) }
+    { return 0.10 / (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 
     { return grossTax(20000) + 0.20 * (income - 20000) }

[NoCoverage] ConditionalExpression
src/incomeTax.ts:10:9
     if ((income >= 0) && (income <= 10000)) { return 0 }
     if ((income > 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }
-    if ((income > 20000) && (income <= 50000)) 
+    if (false) 
     { return grossTax(20000) + 0.20 * (income - 20000) }
      return grossTax(50000) + 0.25 * (income - 50000) 

[NoCoverage] LogicalOperator
src/incomeTax.ts:10:9
     if ((income >= 0) && (income <= 10000)) { return 0 }
     if ((income > 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }
-    if ((income > 20000) && (income <= 50000)) 
+    if (income > 20000 || income <= 50000) 
     { return grossTax(20000) + 0.20 * (income - 20000) }
      return grossTax(50000) + 0.25 * (income - 50000) 

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:11:14
     if ((income > 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 
-    { return grossTax(20000) + 0.20 * (income - 20000) }
+    { return grossTax(20000) - 0.20 * (income - 20000) }
      return grossTax(50000) + 0.25 * (income - 50000) 
 }

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:11:40
     if ((income > 10000) && (income <= 20000)) 
     { return 0.10 * (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 
-    { return grossTax(20000) + 0.20 * (income - 20000) }
+    { return grossTax(20000) + 0.20 * (income + 20000) }
      return grossTax(50000) + 0.25 * (income - 50000) 
 }

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:12:39
     { return 0.10 * (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 
     { return grossTax(20000) + 0.20 * (income - 20000) }
-     return grossTax(50000) + 0.25 * (income - 50000) 
+     return grossTax(50000) + 0.25 * (income + 50000) 
 }
 

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:12:13
     { return 0.10 * (income - 10000) }
     if ((income > 20000) && (income <= 50000)) 
     { return grossTax(20000) + 0.20 * (income - 20000) }
-     return grossTax(50000) + 0.25 * (income - 50000) 
+     return grossTax(50000) - 0.25 * (income - 50000) 
 }
 

[NoCoverage] BlockStatement
src/incomeTax.ts:26:64
 }
 
 // defines the incomes covered by a bracket
-function isInBracket(income:number, bracket:Bracket) : boolean {
-    if (bracket.upper == null) 
-    { return (bracket.lower < income) }
-     return ((bracket.lower < income) && (income <= bracket.upper)) }
+function isInBracket(income:number, bracket:Bracket) : boolean {}
 
 function taxByBracket(income: number, bracket: Bracket): number {

[NoCoverage] ConditionalExpression
src/incomeTax.ts:27:9
 
 // defines the incomes covered by a bracket
 function isInBracket(income:number, bracket:Bracket) : boolean {
-    if (bracket.upper == null) 
+    if (true) 
     { return (bracket.lower < income) }
      return ((bracket.lower < income) && (income <= bracket.upper)) }

[NoCoverage] EqualityOperator
src/incomeTax.ts:27:9
 
 // defines the incomes covered by a bracket
 function isInBracket(income:number, bracket:Bracket) : boolean {
-    if (bracket.upper == null) 
+    if (bracket.upper != null) 
     { return (bracket.lower < income) }
      return ((bracket.lower < income) && (income <= bracket.upper)) }

[NoCoverage] BlockStatement
src/incomeTax.ts:28:5
 // defines the incomes covered by a bracket
 function isInBracket(income:number, bracket:Bracket) : boolean {
     if (bracket.upper == null) 
-    { return (bracket.lower < income) }
+    {}
      return ((bracket.lower < income) && (income <= bracket.upper)) }
 

[NoCoverage] ConditionalExpression
src/incomeTax.ts:28:15
 // defines the incomes covered by a bracket
 function isInBracket(income:number, bracket:Bracket) : boolean {
     if (bracket.upper == null) 
-    { return (bracket.lower < income) }
+    { return (true) }
      return ((bracket.lower < income) && (income <= bracket.upper)) }
 

[NoCoverage] ConditionalExpression
src/incomeTax.ts:29:43
 function isInBracket(income:number, bracket:Bracket) : boolean {
     if (bracket.upper == null) 
     { return (bracket.lower < income) }
-     return ((bracket.lower < income) && (income <= bracket.upper)) }
+     return ((bracket.lower < income) && (true)) }
 
 function taxByBracket(income: number, bracket: Bracket): number {

[NoCoverage] EqualityOperator
src/incomeTax.ts:29:43
 function isInBracket(income:number, bracket:Bracket) : boolean {
     if (bracket.upper == null) 
     { return (bracket.lower < income) }
-     return ((bracket.lower < income) && (income <= bracket.upper)) }
+     return ((bracket.lower < income) && (income < bracket.upper)) }
 
 function taxByBracket(income: number, bracket: Bracket): number {

[NoCoverage] BlockStatement
src/incomeTax.ts:31:65
     { return (bracket.lower < income) }
      return ((bracket.lower < income) && (income <= bracket.upper)) }
 
-function taxByBracket(income: number, bracket: Bracket): number {
-    return bracket.base + bracket.rate * (income - bracket.lower)
-}
+function taxByBracket(income: number, bracket: Bracket): number {}
 
      

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:32:43
      return ((bracket.lower < income) && (income <= bracket.upper)) }
 
 function taxByBracket(income: number, bracket: Bracket): number {
-    return bracket.base + bracket.rate * (income - bracket.lower)
+    return bracket.base + bracket.rate * (income + bracket.lower)
 }
 

[NoCoverage] ArithmeticOperator
src/incomeTax.ts:32:27
      return ((bracket.lower < income) && (income <= bracket.upper)) }
 
 function taxByBracket(income: number, bracket: Bracket): number {
-    return bracket.base + bracket.rate * (income - bracket.lower)
+    return bracket.base + bracket.rate / (income - bracket.lower)
 }
 

[NoCoverage] BlockStatement
src/incomeTax.ts:56:67
 
 // because the brackets are a non-overlapping partition of the positive real numbers,
 // there will be a unique bracket for each income, so the "as Bracket" cast is safe. */
-function income2bracket(income: number, table: TaxTable): Bracket {
-    return table.find(b0 => isInBracket(income, b0)) as Bracket
-}
+function income2bracket(income: number, table: TaxTable): Bracket {}
 
 function grossTax2 (income:number, brackets: Bracket[] ) : number {

[NoCoverage] BlockStatement
src/incomeTax.ts:60:67
     return table.find(b0 => isInBracket(income, b0)) as Bracket
 }
 
-function grossTax2 (income:number, brackets: Bracket[] ) : number {
-    return taxByBracket(income,income2bracket(income,brackets))
-}
+function grossTax2 (income:number, brackets: Bracket[] ) : number {}
     
 const table1 : TaxTable = [

[NoCoverage] ObjectLiteral
src/incomeTax.ts:65:5
 }
     
 const table1 : TaxTable = [
-    {lower:0,     upper:10000, base:0, rate:0},
+    {},
     {lower:10000, upper:20000, base:0, rate:0.10},
     {lower:20000, upper:50000, base:1000, rate:0.20},

[NoCoverage] ObjectLiteral
src/incomeTax.ts:67:5
 const table1 : TaxTable = [
     {lower:0,     upper:10000, base:0, rate:0},
     {lower:10000, upper:20000, base:0, rate:0.10},
-    {lower:20000, upper:50000, base:1000, rate:0.20},
+    {},
     {lower:50000, upper: null, base:7000, rate:0.25}
 ]
