[Killed] BlockStatement
src/TrafficLight.ts:3:70
 export type Color = 'red' | 'green' | 'yellow';
 
-export function colorAtNextSecond(color: Color, time: number): Color {
-  switch (color) {
-    case 'red':
-      return time === 1 ? 'green' : 'red';
-    case 'yellow':
-      return time === 1 ? 'red' : 'yellow';
-    case 'green':
-      return time === 1 ? 'yellow' : 'green';
-    default:
-      throw new Error("This error shouldn't occur.");
-  }
-}
+export function colorAtNextSecond(color: Color, time: number): Color {}
 
 export class TrafficLight {
killedBy: tests for timer after 1, time should be 15
statusReason: Error: This error shouldn't occur.

[Killed] ConditionalExpression
src/TrafficLight.ts:5:5
 
 export function colorAtNextSecond(color: Color, time: number): Color {
   switch (color) {
-    case 'red':
-      return time === 1 ? 'green' : 'red';
+    case 'red':
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
killedBy: tests for timer after 1, time should be 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 20

[Killed] ConditionalExpression
src/TrafficLight.ts:6:14
 export function colorAtNextSecond(color: Color, time: number): Color {
   switch (color) {
     case 'red':
-      return time === 1 ? 'green' : 'red';
+      return true ? 'green' : 'red';
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
killedBy: tests for colors after 7, red should change to red
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "red"
Received: "green"

[Killed] ConditionalExpression
src/TrafficLight.ts:6:14
 export function colorAtNextSecond(color: Color, time: number): Color {
   switch (color) {
     case 'red':
-      return time === 1 ? 'green' : 'red';
+      return false ? 'green' : 'red';
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
killedBy: tests for timer after 1, time should be 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 20

[Killed] ConditionalExpression
src/TrafficLight.ts:7:5
   switch (color) {
     case 'red':
       return time === 1 ? 'green' : 'red';
-    case 'yellow':
-      return time === 1 ? 'red' : 'yellow';
+    case 'yellow':
     case 'green':
       return time === 1 ? 'yellow' : 'green';
killedBy: tests for colors after 1, yellow should change to red
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "red"
Received: "yellow"

[Killed] EqualityOperator
src/TrafficLight.ts:8:14
     case 'red':
       return time === 1 ? 'green' : 'red';
     case 'yellow':
-      return time === 1 ? 'red' : 'yellow';
+      return time !== 1 ? 'red' : 'yellow';
     case 'green':
       return time === 1 ? 'yellow' : 'green';
killedBy: tests for colors after 1, yellow should change to red
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "red"
Received: "yellow"

[Killed] ConditionalExpression
src/TrafficLight.ts:8:14
     case 'red':
       return time === 1 ? 'green' : 'red';
     case 'yellow':
-      return time === 1 ? 'red' : 'yellow';
+      return false ? 'red' : 'yellow';
     case 'green':
       return time === 1 ? 'yellow' : 'green';
killedBy: tests for colors after 1, yellow should change to red
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "red"
Received: "yellow"

[Killed] ConditionalExpression
src/TrafficLight.ts:9:5
       return time === 1 ? 'green' : 'red';
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
-    case 'green':
-      return time === 1 ? 'yellow' : 'green';
+    case 'green':
     default:
       throw new Error("This error shouldn't occur.");
killedBy: tests for colors after 1, green should change to yellow
statusReason: Error: This error shouldn't occur.

[Killed] EqualityOperator
src/TrafficLight.ts:10:14
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
     case 'green':
-      return time === 1 ? 'yellow' : 'green';
+      return time !== 1 ? 'yellow' : 'green';
     default:
       throw new Error("This error shouldn't occur.");
killedBy: tests for colors after 1, green should change to yellow
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "yellow"
Received: "green"

[Killed] ConditionalExpression
src/TrafficLight.ts:10:14
     case 'yellow':
       return time === 1 ? 'red' : 'yellow';
     case 'green':
-      return time === 1 ? 'yellow' : 'green';
+      return false ? 'yellow' : 'green';
     default:
       throw new Error("This error shouldn't occur.");
killedBy: tests for colors after 1, green should change to yellow
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "yellow"
Received: "green"

[NoCoverage] ConditionalExpression
src/TrafficLight.ts:11:5
       return time === 1 ? 'red' : 'yellow';
     case 'green':
       return time === 1 ? 'yellow' : 'green';
-    default:
-      throw new Error("This error shouldn't occur.");
+    default:
   }
 }

[Killed] BlockStatement
src/TrafficLight.ts:22:17
   timeLeft = 20;
 
   /* simulate one second passing */
-  public tick() {
-    this.color = colorAtNextSecond(this.color, this.timeLeft);
-    if (this.timeLeft === 1) {
-      switch (this.color) {
-        case 'red':
-          this.timeLeft = 20;
-          break;
-        case 'yellow':
-          this.timeLeft = 5;
-          break;
-        case 'green':
-          this.timeLeft = 15;
-          break;
-        default:
-          throw new Error("This error shouldn't occur.");
-      }
-    } else {
-      this.timeLeft -= 1;
-    }
-  }
+  public tick() {}
 
   public setTime(t: number) {
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 17

[Killed] ConditionalExpression
src/TrafficLight.ts:24:9
   /* simulate one second passing */
   public tick() {
     this.color = colorAtNextSecond(this.color, this.timeLeft);
-    if (this.timeLeft === 1) {
+    if (false) {
       switch (this.color) {
         case 'red':
killedBy: tests for timer after 1, time should be 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 0

[Killed] ConditionalExpression
src/TrafficLight.ts:24:9
   /* simulate one second passing */
   public tick() {
     this.color = colorAtNextSecond(this.color, this.timeLeft);
-    if (this.timeLeft === 1) {
+    if (true) {
       switch (this.color) {
         case 'red':
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 20

[Survived] ConditionalExpression
src/TrafficLight.ts:26:9
     this.color = colorAtNextSecond(this.color, this.timeLeft);
     if (this.timeLeft === 1) {
       switch (this.color) {
-        case 'red':
-          this.timeLeft = 20;
-          break;
+        case 'red':
         case 'yellow':
           this.timeLeft = 5;

[Survived] ConditionalExpression
src/TrafficLight.ts:29:9
         case 'red':
           this.timeLeft = 20;
           break;
-        case 'yellow':
-          this.timeLeft = 5;
-          break;
+        case 'yellow':
         case 'green':
           this.timeLeft = 15;

[Killed] StringLiteral
src/TrafficLight.ts:29:14
         case 'red':
           this.timeLeft = 20;
           break;
-        case 'yellow':
+        case "":
           this.timeLeft = 5;
           break;
killedBy: tests for colors after 1, green should change to yellow
statusReason: Error: This error shouldn't occur.

[Killed] ConditionalExpression
src/TrafficLight.ts:32:9
         case 'yellow':
           this.timeLeft = 5;
           break;
-        case 'green':
-          this.timeLeft = 15;
-          break;
+        case 'green':
         default:
           throw new Error("This error shouldn't occur.");
killedBy: tests for timer after 1, time should be 15
statusReason: Error: This error shouldn't occur.

[NoCoverage] ConditionalExpression
src/TrafficLight.ts:35:9
         case 'green':
           this.timeLeft = 15;
           break;
-        default:
-          throw new Error("This error shouldn't occur.");
+        default:
       }
     } else {

[NoCoverage] StringLiteral
src/TrafficLight.ts:36:27
           this.timeLeft = 15;
           break;
         default:
-          throw new Error("This error shouldn't occur.");
+          throw new Error("");
       }
     } else {

[Killed] BlockStatement
src/TrafficLight.ts:38:12
         default:
           throw new Error("This error shouldn't occur.");
       }
-    } else {
-      this.timeLeft -= 1;
-    }
+    } else {}
   }
 
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 17

[Killed] AssignmentOperator
src/TrafficLight.ts:39:7
           throw new Error("This error shouldn't occur.");
       }
     } else {
-      this.timeLeft -= 1;
+      this.timeLeft += 1;
     }
   }
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 18

[Killed] BlockStatement
src/TrafficLight.ts:43:29
     }
   }
 
-  public setTime(t: number) {
-    this.timeLeft = t;
-  }
+  public setTime(t: number) {}
 
   public getColor() {
killedBy: tests for timer after 17, time should be 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16
Received: 19

[Killed] BlockStatement
src/TrafficLight.ts:47:21
     this.timeLeft = t;
   }
 
-  public getColor() {
-    return this.color;
-  }
+  public getColor() {}
 }
 
killedBy: tests for colors after 7, red should change to red
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "red"
Received: undefined
